---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinition.ParameterGroup
source: html/45a80176-9f3f-9eb9-7e1d-ab0a24ebf2bc.htm
---
# Autodesk.Revit.DB.ExternalDefinition.ParameterGroup Property

Returns the group ID of the parameter definition.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")]
public override BuiltInParameterGroup ParameterGroup { get; }
```